# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE
#
# com.ibm.streamsx.kafka.KafkaMessages.properties      CDIST2150 - CDIST2199
#

TOPIC_NOT_SPECIFIED=CDIST2150E Rubrique non sp\u00e9cifi\u00e9e. Le sch\u00e9ma d'entr\u00e9e doit contenir un attribut nomm\u00e9 "topic" ou l'un des param\u00e8tres suivants doit \u00eatre indiqu\u00e9 : 'topicAttribute' ou 'topic'
.
INPUT_ATTRIBUTE_NOT_FOUND=CDIST2151E Attribut d''entr\u00e9e introuvable : "{0}".
PREVIOUS_BATCH_FAILED_TO_SEND=CDIST2152E Echec d''envoi du lot pr\u00e9c\u00e9dent : {0}
INVALID_PARAMETER_VALUE_GT=CDIST2153E Valeur non valide pour le param\u00e8tre ''{0}'' : {1}. Les valeurs admises doivent \u00eatre sup\u00e9rieures \u00e0 {2}.
OUTPUT_ATTRIBUTE_NOT_FOUND=CDIST2154E Attribut de sortie introuvable : "{0}"
TRIGGER_PARAM_MISSING=CDIST2155E Le param\u00e8tre 'triggerCount' n'est pas indiqu\u00e9. Ce param\u00e8tre doit \u00eatre indiqu\u00e9 lorsque le d\u00e9clencheur de la r\u00e9gion coh\u00e9rente correspond \u00e0 operatorDriven.
ERROR_ACQUIRING_PERMIT=CDIST2156E Erreur lors de l''acquisition de l''autorisation : {0}
OUTPUT_MESSAGE_ATTRIBUTE_MISSING=CDIST2157E Le param\u00e8tre 'outputMessageAttributeName' doit indiquer un attribut de sortie existant ou le sch\u00e9ma de sortie doit contenir un attribut de sortie nomm\u00e9 "message".
INVALID_MESSAGEHUB_JSON_CREDS=CDIST2158E Donn\u00e9es d''identification MessageHub JSON non valides : {0}
APPLICATION_CONFIGURATION_NOT_FOUND=CDIST2159W Configuration d''application introuvable : {0}
MESSAGE_ATTRIBUTE_NOT_FOUND=CDIST2160E Message non sp\u00e9cifi\u00e9. Le param\u00e8tre 'messageAttribute' doit \u00eatre indiqu\u00e9 ou le sch\u00e9ma d'entr\u00e9e doit contenir un attribut nomm\u00e9 "message".
OPERATOR_NOT_START_OF_CONSISTENT_REGION=CDIST2161E L'op\u00e9rateur {0} ne peut pas \u00eatre au d\u00e9but d'une r\u00e9gion coh\u00e9rente.
PARTITION_ATTRIBUTE_NOT_INT32=CDIST2162E L'attribut d'entr\u00e9e 'partition' doit avoir le type "int32" lorsque le param\u00e8tre 'partitionAttribute' n'est pas indiqu\u00e9.
UNSUPPORTED_TYPE_EXCEPTION=CDIST2163E Type "{0}" non pris en charge lors de la d\u00e9finition de l''attribut "{1}"
START_TIME_PARAM_NOT_FOUND=CDIST2164E Le param\u00e8tre 'startTime' doit \u00eatre indiqu\u00e9 lorsque le param\u00e8tre 'startPosition' est d\u00e9fini avec la valeur "Time".
PARAMS_IGNORED_WITH_INPUT_PORT=CDIST2165W Les param\u00e8tres 'topic', 'partition' et 'startPositition' sont ignor\u00e9s lorsque le port d'entr\u00e9e est pr\u00e9sent.
TOPIC_OR_INPUT_PORT=CDIST2166E Le param\u00e8tre 'topic' doit \u00eatre indiqu\u00e9 lorsqu'aucun port d'entr\u00e9e n'est d\u00e9fini.
INVALID_JSON_MISSING_KEY=CDIST2167E JSON non valide. Cl\u00e9 \"{0}\" manquante. La mise \u00e0 jour est ignor\u00e9e. jsonString={1}
PROPERTIES_FILE_NOT_FOUND=CDIST2168W Le fichier de propri\u00e9t\u00e9s est introuvable : {0}
START_OFFSET_PARAM_NOT_FOUND=CDIST2169E Le param\u00e8tre 'startOffset' doit \u00eatre indiqu\u00e9 lorsque le param\u00e8tre 'startPosition' est d\u00e9fini avec la valeur "Offset".
PARTITION_SIZE_NOT_EQUAL_TO_OFFSET_SIZE=CDIST2170E Le nombre de valeurs indiqu\u00e9es pour le param\u00e8tre 'partitionParameter' doit \u00eatre identique au nombre de valeurs indiqu\u00e9es pour le param\u00e8tre 'startOffset'.
ONLY_ONE_TOPIC_WHEN_USING_STARTOFFSET_PARAM=CDIST2171E Lorsque le param\u00e8tre 'startPosition' a la valeur 'Offset', il ne peut y avoir qu'une seule rubrique indiqu\u00e9e via le param\u00e8tre 'topic'. 
STREAMS_CONTROL_TOPIC_NOT_PRESENT=CDIST2172E La rubrique de contr\u00f4le du producteur transactionnel \"{0}\" est absente et le courtier ne peut pas la cr\u00e9er automatiquement. Contactez l''administrateur de votre courtier pour cr\u00e9er cette rubrique.
