# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE
#
# com.ibm.streamsx.kafka.KafkaMessages.properties      CDIST2150 - CDIST2199
#

TOPIC_NOT_SPECIFIED=CDIST2150E O t\u00f3pico n\u00e3o foi especificado. O esquema de entrada deve conter um atributo chamado "topic" ou um dos seguintes par\u00e2metros deve ser especificado: 'topicAttribute' ou 'topic'
.
INPUT_ATTRIBUTE_NOT_FOUND=CDIST2151E Atributo de entrada n\u00e3o localizado: "{0}".
PREVIOUS_BATCH_FAILED_TO_SEND=CDIST2152E O lote anterior falhou ao enviar: {0}
INVALID_PARAMETER_VALUE_GT=CDIST2153E Valor inv\u00e1lido para o par\u00e2metro ''{0}'': {1}. Os valores v\u00e1lidos devem ser maiores que {2}.
OUTPUT_ATTRIBUTE_NOT_FOUND=CDIST2154E Atributo de sa\u00edda n\u00e3o localizado: "{0}"
TRIGGER_PARAM_MISSING=CDIST2155E O par\u00e2metro 'triggerCount' n\u00e3o foi especificado. O par\u00e2metro 'triggerCount' deve ser especificado quando o acionador para a regi\u00e3o consistente \u00e9 operatorDriven.
ERROR_ACQUIRING_PERMIT=CDIST2156E Erro ao adquirir a permiss\u00e3o: {0}
OUTPUT_MESSAGE_ATTRIBUTE_MISSING=CDIST2157E O par\u00e2metro 'outputMessageAttributeName' deve especificar um atributo de sa\u00edda existente ou o esquema de sa\u00edda deve conter um atributo de sa\u00edda chamado "message".
INVALID_MESSAGEHUB_JSON_CREDS=CDIST2158E Credenciais MessageHub JSON inv\u00e1lidas: {0}
APPLICATION_CONFIGURATION_NOT_FOUND=CDIST2159W Configura\u00e7\u00e3o de aplicativo n\u00e3o localizada: {0}
MESSAGE_ATTRIBUTE_NOT_FOUND=CDIST2160E A mensagem n\u00e3o foi especificada. O par\u00e2metro 'messageAttribute' deve ser especificado ou o esquema de entrada deve conter um atributo chamado "message".
OPERATOR_NOT_START_OF_CONSISTENT_REGION=CDIST2161E O operador {0} n\u00e3o pode ser o in\u00edcio de uma regi\u00e3o consistente.
PARTITION_ATTRIBUTE_NOT_INT32=CDIST2162E O atributo de entrada 'partition' deve ter um tipo de "int32" quando o par\u00e2metro 'partitionAttribute' n\u00e3o est\u00e1 especificado.
UNSUPPORTED_TYPE_EXCEPTION=CDIST2163E Tipo n\u00e3o suportado: "{0}" ao configurar o atributo "{1}"
START_TIME_PARAM_NOT_FOUND=CDIST2164E O par\u00e2metro 'startTime' deve ser especificado quando o valor do par\u00e2metro 'startPosition' est\u00e1 configurado como "Time".
PARAMS_IGNORED_WITH_INPUT_PORT=CDIST2165W Os par\u00e2metros 'topic', 'partition' e 'startPositition' s\u00e3o ignorados quando a porta de entrada est\u00e1 presente.
TOPIC_OR_INPUT_PORT=CDIST2166E O par\u00e2metro 'topic' deve ser especificado quando nenhuma porta de entrada est\u00e1 definida.
INVALID_JSON_MISSING_KEY=CDIST2167E JSON inv\u00e1lido! Chave \"{0}\" ausente. A atualiza\u00e7\u00e3o est\u00e1 sendo ignorada. jsonString={1}
PROPERTIES_FILE_NOT_FOUND=CDIST2168W O arquivo de propriedades n\u00e3o pode ser localizado: {0}
START_OFFSET_PARAM_NOT_FOUND=CDIST2169E O par\u00e2metro 'startOffset' deve ser especificado quando o valor do par\u00e2metro 'startPosition' est\u00e1 configurado como "Offset".
PARTITION_SIZE_NOT_EQUAL_TO_OFFSET_SIZE=CDIST2170E O n\u00famero de valores especificado para o 'partitionParameter' deve ser o mesmo que o n\u00famero de valores especificado para o par\u00e2metro 'startOffset'.
ONLY_ONE_TOPIC_WHEN_USING_STARTOFFSET_PARAM=CDIST2171E Quando o par\u00e2metro 'startPosition' \u00e9 configurado como 'Offset', apenas um \u00fanico t\u00f3pico pode ser especificado por meio do par\u00e2metro 'topic'. 
# CDIST2172E is unused
STREAMS_CONTROL_TOPIC_NOT_PRESENT=CDIST2172E O t\u00f3pico de controle para o produtor transacional \"{0}\" n\u00e3o est\u00e1 presente e n\u00e3o pode ser criado automaticamente pelo broker. Entre em contato com o administrador do broker para criar este t\u00f3pico.
