# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE
#
# com.ibm.streamsx.kafka.KafkaMessages.properties      CDIST2150 - CDIST2199
#

TOPIC_NOT_SPECIFIED=CDIST2150E O t\u00f3pico n\u00e3o foi especificado. Ou o esquema de entrada deve conter um atributo denominado "topic" ou um dos par\u00e2metros a seguir deve ser especificado: 'topicAttribute' ou 'topic'.
INPUT_ATTRIBUTE_NOT_FOUND=CDIST2151E Atributo de entrada n\u00e3o localizado: ''{0}''.
PREVIOUS_BATCH_FAILED_TO_SEND=CDIST2152E O lote anterior falhou ao enviar: {0}
INVALID_PARAMETER_VALUE_GT=CDIST2153E Valor inv\u00e1lido para o par\u00e2metro ''{0}'': {1}. Os valores v\u00e1lidos devem ser maiores que {2}.
OUTPUT_ATTRIBUTE_NOT_FOUND=CDIST2154E Atributo de sa\u00edda n\u00e3o localizado no esquema do fluxo: ''{0}''
TRIGGER_PARAM_MISSING=CDIST2155E O par\u00e2metro 'triggerCount' n\u00e3o foi especificado. O par\u00e2metro 'triggerCount' deve ser especificado quando o acionador para a regi\u00e3o consistente \u00e9 operatorDriven.
ERROR_ACQUIRING_PERMIT=CDIST2156E Erro ao adquirir a permiss\u00e3o: {0}
OUTPUT_MESSAGE_ATTRIBUTE_MISSING=CDIST2157E O par\u00e2metro 'outputMessageAttributeName' deve especificar um atributo de sa\u00edda existente ou o esquema de sa\u00edda deve conter um atributo de sa\u00edda chamado "message".
# TRNOTE: do not translate "Event Streams"
INVALID_MESSAGEHUB_JSON_CREDS=CDIST2158E JSON de credenciais de servi\u00e7o do Streams de evento inv\u00e1lido do JSON: {0}
APPLICATION_CONFIGURATION_NOT_FOUND=CDIST2159W Configura\u00e7\u00e3o de aplicativo n\u00e3o localizada: {0}
MESSAGE_ATTRIBUTE_NOT_FOUND=CDIST2160E A mensagem n\u00e3o foi especificada. O par\u00e2metro 'messageAttribute' deve ser especificado ou o esquema de entrada deve conter um atributo chamado "message".
OPERATOR_NOT_START_OF_CONSISTENT_REGION=CDIST2161E O operador {0} n\u00e3o pode ser o in\u00edcio de uma regi\u00e3o consistente.
PARTITION_ATTRIBUTE_NOT_INT32=CDIST2162E O atributo de entrada 'partition' deve ter um tipo de "int32" quando o par\u00e2metro 'partitionAttribute' n\u00e3o est\u00e1 especificado.
UNSUPPORTED_TYPE_EXCEPTION=CDIST2163E Tipo n\u00e3o suportado: ''{0}'' ao configurar o atributo ''{1}''
START_TIME_PARAM_NOT_FOUND=CDIST2164E O par\u00e2metro 'startTime' deve ser especificado quando o valor de par\u00e2metro 'startPosition' ou 'startPositionStr' \u00e9 configurado como "Time".
PARAMS_INCOMPATIBLE_WITH_INPUT_PORT=CDIST2165E Os par\u00e2metros 'topic', 'pattern', 'partition', 'startPositition' e 'startPosititionStr' n\u00e3o podem ser usados quando a porta de entrada est\u00e1 presente.
TOPIC_OR_INPUT_PORT=CDIST2166E O par\u00e2metro 'topic' ou 'pattern' dever\u00e1 ser especificado quando nenhuma porta de entrada estiver definida.
INVALID_JSON_MISSING_KEY=CDIST2167E JSON inv\u00e1lido. Chave ''{0}'' ausente. A a\u00e7\u00e3o est\u00e1 sendo ignorada. jsonString={1}
PROPERTIES_FILE_NOT_FOUND=CDIST2168W O arquivo de propriedades n\u00e3o pode ser localizado: {0}
START_OFFSET_PARAM_NOT_FOUND=CDIST2169E O par\u00e2metro 'startOffset' deve ser especificado quando o valor de par\u00e2metro 'startPosition' ou 'startPositionStr' \u00e9 configurado como "Offset".
PARTITION_SIZE_NOT_EQUAL_TO_OFFSET_SIZE=CDIST2170E O n\u00famero de valores especificados para o par\u00e2metro 'partition' 'deve ser o mesmo que o n\u00famero de valores especificados para o par\u00e2metro 'startOffset'.
ONLY_ONE_TOPIC_WHEN_USING_STARTOFFSET_PARAM=CDIST2171E Quando o par\u00e2metro 'startPosition' ou 'startPositionStr' \u00e9 configurado como 'Offset', apenas um \u00fanico t\u00f3pico pode ser especificado por meio do par\u00e2metro 'topic'.
PROPERTIES_FILE_NOT_READABLE=CDIST2172E O arquivo de propriedades {0} n\u00e3o pode ser lido: {1}
OFFSET_COMMIT_FAILED_FOR_PARTITION=CDIST2173W Os deslocamentos n\u00e3o puderam ser confirmados para a parti\u00e7\u00e3o de t\u00f3pico {0}: {1}
OFFSET_COMMIT_FAILED=CDIST2174W Os deslocamentos n\u00e3o puderam ser confirmados: {0}
PARAM_IGNORED_IN_CONSITENT_REGION=CDIST2175W O par\u00e2metro ''{0}'' \u00e9 ignorado quando o operador faz parte de uma regi\u00e3o consistente.
PARAM_IGNORED_NOT_IN_CONSITENT_REGION=CDIST2176W O par\u00e2metro ''{0}'' \u00e9 ignorado quando o operador n\u00e3o faz parte de uma regi\u00e3o consistente.
PARAM_INCOMPATIBLE_WITH_OTHER_PARAM_VAL=CDIST2177E O par\u00e2metro ''{0}'' n\u00e3o pode ser usado quando o par\u00e2metro ''{1}'' tem o valor ''{2}''.
PARAM_VAL_INCOMPATIBLE_WITH_OTHER_PARAM_VAL=CDIST2178E O par\u00e2metro ''{0}'' n\u00e3o pode ter o valor ''{1}'' quando o par\u00e2metro ''{2}'' tem o valor ''{3}''.
PARAM_VAL_INCOMPATIBLE_WITH_INPUT_PORT=CDIST2179E O operador n\u00e3o pode ter uma porta de entrada quando o par\u00e2metro ''{1}'' tem o valor ''{2}''.
PARAM_IGNORED_FOR_PERIODIC_CR=CDIST2180W O par\u00e2metro ''{0}'' \u00e9 ignorado em uma regi\u00e3o consistente peri\u00f3dica.
CONSUMER_GROUP_IN_MULTIPLE_CONSISTENT_REGIONS=CDIST2181E V\u00e1rias regi\u00f5es consistentes detectadas para os operadores {0} no grupo de consumidores ''{1}''. Todos os operadores de consumo de um grupo de consumidores devem participar da mesma regi\u00e3o consistente.
PARAM_X_REQUIRED_WHEN_PARAM_Y_USED=CDIST2182E O par\u00e2metro ''{0}'' dever\u00e1 ser especificado quando o par\u00e2metro ''{1}'' for usado.
INVALID_PARAMETER_VALUE=CDIST2183E O valor ''{0}'' \u00e9 inv\u00e1lido para o par\u00e2metro ''{1}''. Os valores v\u00e1lidos s\u00e3o {2}.
WARN_CONTROLPORT_DEPRECATED_IN_CR=CDIST2184W O uso da porta de entrada de controle opcional no operador ''{0}'' foi descontinuado quando o operador fez parte de uma regi\u00e3o consistente.
# TRNOTE: do not translate "startPosition: {0};"
JCP_REQUIRED_NOCR_STARTPOS_NOT_DEFAULT=CDIST2185E Para suportar ''startPosition: {0};'' e ''startPositionStr: \"{0}\";'', o gr\u00e1fico do aplicativo deve conter um operador ''JobControlPlane''. Inclua um operador ''JobControlPlane'' em seu gr\u00e1fico de aplicativos. 
WARN_ENSURE_JCP_ADDED_STARTPOS_NOT_DEFAULT=CDIST2186W Para suportar totalmente valores diferentes de ''Default'' para o par\u00e2metro ''startPosition'' ou ''startPositionStr'' no operador ''{0}'', o gr\u00e1fico do aplicativo deve conter um operador ''JobControlPlane''. Lembre-se de incluir um operador ''JobControlPlane'' em seu gr\u00e1fico de aplicativos.
PARAMETERS_EXCLUDE_EACH_OTHER=CDIST2187E O par\u00e2metro ''{0}'' e o par\u00e2metro ''{1}'' excluem uns aos outros. Especifique somente um deles.
PATTERN_SUBSCRIPTION_REQUIRES_GROUP_MGT=CDIST2188E O par\u00e2metro ''{0}'' s\u00f3 pode ser usado quando o gerenciamento do grupo Kafka pode ser ativado. Certifique-se de que o operador ''{1}'' esteja configurado de uma maneira que possibilite o gerenciamento de grupo. Consulte a documenta\u00e7\u00e3o do SPL do operador ''{2}'' para as pr\u00e9-condi\u00e7\u00f5es.
TOPIC_ATTRIBUTE_NOT_STRING=CDIST2189E O atributo de entrada 'topic' dever\u00e1 ter um tipo de "rstring" ou "ustring" quando o par\u00e2metro 'topicAttribute' n\u00e3o for especificado.
PRODUCER_INVALID_OPORT_SCHEMA=CDIST2190E Esquema inv\u00e1lido para a porta de sa\u00edda opcional do operador ''{0}''. A porta suporta dois atributos opcionais, um deve ser um rstring, ustring ou um opcional deles, e um tipo de tupla com o mesmo esquema que a porta de entrada do operador.
INVALID_JSON=CDIST2191E JSON inv\u00e1lido. A a\u00e7\u00e3o est\u00e1 sendo ignorada. jsonString=''{0}''
UNSUPPORTED_ATTR_TYPE=CDIST2192E O operador {0} n\u00e3o suporta o tipo ''{1}'' para o atributo ''{2}''.
