# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE
#
# com.ibm.streamsx.kafka.KafkaMessages.properties      CDIST2150 - CDIST2199
#

TOPIC_NOT_SPECIFIED=CDIST2150E \u30c8\u30d4\u30c3\u30af\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002 \u5165\u529b\u30b9\u30ad\u30fc\u30de\u306b "topic" \u3068\u3044\u3046\u540d\u524d\u306e\u5c5e\u6027\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u304b\u3001\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc 'topicAttribute' \u307e\u305f\u306f 'topic' \u306e\u3044\u305a\u308c\u304b\u3092\u6307\u5b9a\u3059\u308b\u304b\u306e\u3069\u3061\u3089\u304b\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
.
INPUT_ATTRIBUTE_NOT_FOUND=CDIST2151E \u5165\u529b\u5c5e\u6027\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f: "{0}"\u3002
PREVIOUS_BATCH_FAILED_TO_SEND=CDIST2152E \u524d\u306e\u30d0\u30c3\u30c1\u306e\u9001\u4fe1\u304c\u5931\u6557\u3057\u307e\u3057\u305f: {0}
INVALID_PARAMETER_VALUE_GT=CDIST2153E ''{0}'' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306e\u5024\u304c\u7121\u52b9\u3067\u3059: {1}\u3002 \u6709\u52b9\u306a\u5024\u306f {2} \u3088\u308a\u5927\u304d\u304f\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
OUTPUT_ATTRIBUTE_NOT_FOUND=CDIST2154E \u51fa\u529b\u5c5e\u6027\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f: "{0}"
TRIGGER_PARAM_MISSING=CDIST2155E 'triggerCount' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002 \u6574\u5408\u9818\u57df\u306e\u30c8\u30ea\u30ac\u30fc\u304c  operatorDriven \u306e\u5834\u5408\u3001'triggerCount' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u6307\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
ERROR_ACQUIRING_PERMIT=CDIST2156E \u8a31\u53ef\u306e\u53d6\u5f97\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f: {0}
OUTPUT_MESSAGE_ATTRIBUTE_MISSING=CDIST2157E 'outputMessageAttributeName' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306b\u65e2\u5b58\u306e\u51fa\u529b\u5c5e\u6027\u3092\u6307\u5b9a\u3059\u308b\u304b\u3001\u51fa\u529b\u30b9\u30ad\u30fc\u30de\u306b "message" \u3068\u3044\u3046\u540d\u524d\u306e\u51fa\u529b\u5c5e\u6027\u3092\u542b\u3081\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
INVALID_MESSAGEHUB_JSON_CREDS=CDIST2158E \u7121\u52b9\u306a MessageHub Credentials JSON: {0}
APPLICATION_CONFIGURATION_NOT_FOUND=CDIST2159W \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u69cb\u6210\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093: {0}
MESSAGE_ATTRIBUTE_NOT_FOUND=CDIST2160E \u30e1\u30c3\u30bb\u30fc\u30b8\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002 'messageAttribute' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u6307\u5b9a\u3059\u308b\u304b\u3001\u5165\u529b\u30b9\u30ad\u30fc\u30de\u306b "message" \u3044\u3046\u540d\u524d\u306e\u5c5e\u6027\u3092\u542b\u3081\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
OPERATOR_NOT_START_OF_CONSISTENT_REGION=CDIST2161E {0} \u30aa\u30da\u30ec\u30fc\u30bf\u30fc\u306f\u6574\u5408\u9818\u57df\u306e\u958b\u59cb\u306b\u4f7f\u7528\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
PARTITION_ATTRIBUTE_NOT_INT32=CDIST2162E 'partitionAttribute' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u3001'partition' \u5165\u529b\u5c5e\u6027\u306f "int32" \u578b\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
UNSUPPORTED_TYPE_EXCEPTION=CDIST2163E \u5c5e\u6027 "{1}" \u3092\u8a2d\u5b9a\u4e2d\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u306a\u3044\u578b: "{0}"
START_TIME_PARAM_NOT_FOUND=CDIST2164E 'startPosition' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u5024\u304c "Time" \u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001'startTime' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u6307\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
PARAMS_IGNORED_WITH_INPUT_PORT=CDIST2165W \u5165\u529b\u30dd\u30fc\u30c8\u304c\u5b58\u5728\u3059\u308b\u5834\u5408\u3001\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306e 'topic'\u3001'partition'\u3001\u304a\u3088\u3073 'startPositition' \u306f\u7121\u8996\u3055\u308c\u307e\u3059\u3002
TOPIC_OR_INPUT_PORT=CDIST2166E \u5165\u529b\u30dd\u30fc\u30c8\u304c\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u3001'topic' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u6307\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
INVALID_JSON_MISSING_KEY=CDIST2167E \u7121\u52b9\u306a JSON! \"{0}\" \u30ad\u30fc\u304c\u3042\u308a\u307e\u305b\u3093\u3002 \u66f4\u65b0\u306f\u7121\u8996\u3055\u308c\u3066\u3044\u307e\u3059\u3002 jsonString={1}
PROPERTIES_FILE_NOT_FOUND=CDIST2168W \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u30fb\u30d5\u30a1\u30a4\u30eb\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093: {0}
START_OFFSET_PARAM_NOT_FOUND=CDIST2169E 'startPosition' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u5024\u304c "Offset" \u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001'startOffset' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u6307\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
PARTITION_SIZE_NOT_EQUAL_TO_OFFSET_SIZE=CDIST2170E 'partitionParameter' \u306b\u6307\u5b9a\u3055\u308c\u305f\u5024\u306e\u6570\u306f\u3001'startOffset' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306b\u6307\u5b9a\u3055\u308c\u305f\u5024\u306e\u6570\u3068\u540c\u3058\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
ONLY_ONE_TOPIC_WHEN_USING_STARTOFFSET_PARAM=CDIST2171E 'startPosition' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u304c 'Offset' \u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001'topic' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u4f7f\u7528\u3057\u3066 1 \u3064\u306e\u30c8\u30d4\u30c3\u30af\u306e\u307f\u3092\u6307\u5b9a\u3067\u304d\u307e\u3059\u3002 
# CDIST2172E is unused
STREAMS_CONTROL_TOPIC_NOT_PRESENT=CDIST2172E \u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u306e\u30d7\u30ed\u30c7\u30e5\u30fc\u30b5\u30fc \"{0}\" \u306e\u30b3\u30f3\u30c8\u30ed\u30fc\u30eb\u30fb\u30c8\u30d4\u30c3\u30af\u306f\u5b58\u5728\u305b\u305a\u3001\u30d6\u30ed\u30fc\u30ab\u30fc\u304c\u81ea\u52d5\u7684\u306b\u4f5c\u6210\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002 \u3053\u306e\u30c8\u30d4\u30c3\u30af\u3092\u4f5c\u6210\u3059\u308b\u306b\u306f\u3001\u30d6\u30ed\u30fc\u30ab\u30fc\u7ba1\u7406\u8005\u306b\u554f\u3044\u5408\u308f\u305b\u3066\u304f\u3060\u3055\u3044\u3002
