# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE
#
# com.ibm.streamsx.kafka.KafkaMessages.properties      CDIST2150 - CDIST2199
#

TOPIC_NOT_SPECIFIED=CDIST2150E No se ha especificado el tema. O bien el esquema de entrada debe contener un atributo llamado "topic", o bien uno es necesario especificar uno de los par\u00e1metros siguientes: 'topicAttribute' o 'topic'.
INPUT_ATTRIBUTE_NOT_FOUND=CDIST2151E No se ha encontrado el atributo de entrada: ''{0}''.
PREVIOUS_BATCH_FAILED_TO_SEND=CDIST2152E El lote anterior no ha podido enviar: {0}
INVALID_PARAMETER_VALUE_GT=CDIST2153E Valor no v\u00e1lido para el par\u00e1metro ''{0}'': {1}. Los valores v\u00e1lidos tienen que ser mayores que {2}.
OUTPUT_ATTRIBUTE_NOT_FOUND=CDIST2154E No se ha encontrado el atributo de salida en el esquema de la secuencia: ''{0}''
TRIGGER_PARAM_MISSING=CDIST2155E No se ha especificado el par\u00e1metro 'triggerCount'. El par\u00e1metro 'triggerCount' se tiene que especificar cuando el desencadenante de la regi\u00f3n coherente es operatorDriven.
ERROR_ACQUIRING_PERMIT=CDIST2156E Error al adquirir permiso: {0}
OUTPUT_MESSAGE_ATTRIBUTE_MISSING=CDIST2157E O bien el par\u00e1metro 'outputMessageAttributeName' debe especificar un atributo de salida existente, o bien el esquema de salida debe contener un atributo de salida llamado "message".
# TRNOTE: do not translate "Event Streams"
INVALID_MESSAGEHUB_JSON_CREDS=CDIST2158E El JSON de credenciales del servicio de Event Streams no es v\u00e1lido: {0}
APPLICATION_CONFIGURATION_NOT_FOUND=CDIST2159W No se ha encontrado la configuraci\u00f3n de aplicaci\u00f3n: {0}
MESSAGE_ATTRIBUTE_NOT_FOUND=CDIST2160E No se ha especificado el mensaje. O bien se debe especificar el par\u00e1metro 'messageAttribute', o bien el esquema de entrada debe contener un atributo llamado "message".
OPERATOR_NOT_START_OF_CONSISTENT_REGION=CDIST2161E El operador {0} no puede ser el inicio de una regi\u00f3n coherente.
PARTITION_ATTRIBUTE_NOT_INT32=CDIST2162E El atributo de entrada 'partition' debe tener un tipo "int32" cuando no se especifica el par\u00e1metro 'partitionAttribute'.
UNSUPPORTED_TYPE_EXCEPTION=CDIST2163E Tipo no soportado: ''{0}'' al establecer el atributo ''{1}''
START_TIME_PARAM_NOT_FOUND=CDIST2164E El par\u00e1metro 'startTime' se tiene que especificar cuando el valor del par\u00e1metro 'startPosition' se establece en "Time".
PARAMS_INCOMPATIBLE_WITH_INPUT_PORT=CDIST2165E Los par\u00e1metros 'topic', 'pattern', 'partition' y 'startPositition' no se pueden utilizar cuando el puerto de entrada est\u00e1 presente.
TOPIC_OR_INPUT_PORT=CDIST2166E Se debe especificar el par\u00e1metro 'topic' o 'pattern' cuando no se define ning\u00fan puerto de entrada.
INVALID_JSON_MISSING_KEY=CDIST2167E JSON no v\u00e1lido. Falta la clave ''{0}''. Se est\u00e1 ignorando la acci\u00f3n. jsonString={1}
PROPERTIES_FILE_NOT_FOUND=CDIST2168W No se puede encontrar el archivo de propiedades: {0}
START_OFFSET_PARAM_NOT_FOUND=CDIST2169E El par\u00e1metro 'startOffset' se tiene que especificar cuando el valor del par\u00e1metro 'startPosition' se establece en "Offset".
PARTITION_SIZE_NOT_EQUAL_TO_OFFSET_SIZE=CDIST2170E El n\u00famero de valores especificado para el par\u00e1metro 'partition' debe ser el mismo que el n\u00famero de valores especificado para el par\u00e1metro 'startOffset'.
ONLY_ONE_TOPIC_WHEN_USING_STARTOFFSET_PARAM=CDIST2171E Cuando el par\u00e1metro 'startPosition' se establece en 'Offset', solo se puede especificar un \u00fanico tema a trav\u00e9s del par\u00e1metro 'topic'.
PROPERTIES_FILE_NOT_READABLE=CDIST2172E No se puede encontrar el archivo de propiedades {0}: {1}
OFFSET_COMMIT_FAILED_FOR_PARTITION=CDIST2173W No se pudieron confirmar los desplazamientos para la partici\u00f3n de tema {0}: {1}
OFFSET_COMMIT_FAILED=CDIST2174W No se pudieron confirmar los desplazamientos: {0}
PARAM_IGNORED_IN_CONSITENT_REGION=CDIST2175W El par\u00e1metro ''{0}'' se ignora cuando el operador forma parte de una regi\u00f3n coherente.
PARAM_IGNORED_NOT_IN_CONSITENT_REGION=CDIST2176W El par\u00e1metro ''{0}'' se ignora cuando el operador no forma parte de una regi\u00f3n coherente.
PARAM_INCOMPATIBLE_WITH_OTHER_PARAM_VAL=CDIST2177E No se puede utilizar el par\u00e1metro ''{0}'' cuando el par\u00e1metro ''{1}'' tiene el valor ''{2}''.
PARAM_VAL_INCOMPATIBLE_WITH_OTHER_PARAM_VAL=CDIST2178E El par\u00e1metro ''{0}'' no puede tener el valor ''{1}'' cuando el par\u00e1metro ''{2}'' tiene el valor ''{3}''.
PARAM_VAL_INCOMPATIBLE_WITH_INPUT_PORT=CDIST2179E El operador no puede tener un puerto de entrada cuando el par\u00e1metro ''{1}'' tiene el valor ''{2}''.
PARAM_IGNORED_FOR_PERIODIC_CR=CDIST2180W El par\u00e1metro ''{0}'' se ignora en una regi\u00f3n coherente peri\u00f3dica.
CONSUMER_GROUP_IN_MULTIPLE_CONSISTENT_REGIONS=CDIST2181E Se han detectado varias regiones coherentes para {0} operadores en el grupo de consumidores ''{1}''. Todos los operadores de un grupo de consumidores deben participar en la misma regi\u00f3n coherente.
PARAM_X_REQUIRED_WHEN_PARAM_Y_USED=CDIST2182E Se debe especificar el par\u00e1metro ''{0}'' cuando se utiliza el par\u00e1metro ''{1}''.
INVALID_PARAMETER_VALUE=CDIST2183E El valor ''{0}'' no es v\u00e1lido para el par\u00e1metro ''{1}''. Los valores v\u00e1lidos son {2}.
WARN_CONTROLPORT_DEPRECATED_IN_CR=CDIST2184W El uso del puerto de entrada de control opcional en el operador ''{0}'' ha quedado en desuso cuando el operador forma parte de una regi\u00f3n coherente.
# TRNOTE: do not translate "startPosition: {0};"
JCP_REQUIRED_NOCR_STARTPOS_NOT_DEFAULT=CDIST2185E Para dar soporte a ''startPosition: {0};'', el gr\u00e1fico de aplicaciones debe contener un operador ''JobControlPlane''. A\u00f1ada un operador ''JobControlPlane'' a su gr\u00e1fico de aplicaciones. 
WARN_ENSURE_JCP_ADDED_STARTPOS_NOT_DEFAULT=CDIST2186W Para dar soporte completo a otros valores distintos de ''Default'' para el par\u00e1metro ''startPosition'' en el operador ''{0}'', el gr\u00e1fico de aplicaci\u00f3n debe contener un operador ''JobControlPlane''. Recuerde a\u00f1adir un operador ''JobControlPlane'' al gr\u00e1fico de aplicaci\u00f3n.
PARAMETERS_EXCLUDE_EACH_OTHER=CDIST2187E El par\u00e1metro ''{0}'' y el par\u00e1metro ''{1}'' se excluyen entre s\u00ed. Especifique s\u00f3lo uno de ellos.
PATTERN_SUBSCRIPTION_REQUIRES_GROUP_MGT=CDIST2188E El par\u00e1metro ''{0}'' solo se puede utilizar cuando se pueda habilitar la gesti\u00f3n de grupos de Kafka. Aseg\u00farese de que el operador ''{1}'' est\u00e1 configurado de una forma que habilita la gesti\u00f3n de grupos. Consulte la documentaci\u00f3n de SPL del operador ''{2}'' para obtener las condiciones previas.
TOPIC_ATTRIBUTE_NOT_STRING=CDIST2189E El atributo de entrada 'topic' debe tener un tipo de "rstring" o "ustring" cuando no se ha especificado el par\u00e1metro 'topicAttribute'.
PRODUCER_INVALID_OPORT_SCHEMA=CDIST2190E Esquema no v\u00e1lido para el puerto de salida opcional del operador ''{0}''. El puerto da soporte a dos atributos opcionales, uno debe ser un rstring, ustring o uno opcional de ellos, y otro un tipo de tupla con el mismo esquema que el puerto de entrada del operador.
INVALID_JSON=CDIST2191E JSON no v\u00e1lido. Se est\u00e1 ignorando la acci\u00f3n. jsonString=''{0}''
