# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE
#
# com.ibm.streamsx.kafka.KafkaMessages.properties      CDIST2150 - CDIST2199
#

TOPIC_NOT_SPECIFIED=CDIST2150E \u30c8\u30d4\u30c3\u30af\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002 \u5165\u529b\u30b9\u30ad\u30fc\u30de\u306b "topic" \u3068\u3044\u3046\u540d\u524d\u306e\u5c5e\u6027\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u304b\u3001\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc 'topicAttribute' \u307e\u305f\u306f 'topic' \u306e\u3044\u305a\u308c\u304b\u3092\u6307\u5b9a\u3059\u308b\u304b\u306e\u3069\u3061\u3089\u304b\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
INPUT_ATTRIBUTE_NOT_FOUND=CDIST2151E \u5165\u529b\u5c5e\u6027\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f: ''{0}''\u3002
PREVIOUS_BATCH_FAILED_TO_SEND=CDIST2152E \u524d\u306e\u30d0\u30c3\u30c1\u306e\u9001\u4fe1\u304c\u5931\u6557\u3057\u307e\u3057\u305f: {0}
INVALID_PARAMETER_VALUE_GT=CDIST2153E ''{0}'' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306e\u5024\u304c\u7121\u52b9\u3067\u3059: {1}\u3002 \u6709\u52b9\u306a\u5024\u306f {2} \u3088\u308a\u5927\u304d\u304f\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
OUTPUT_ATTRIBUTE_NOT_FOUND=CDIST2154E \u30b9\u30c8\u30ea\u30fc\u30e0\u30fb\u30b9\u30ad\u30fc\u30de\u306b\u51fa\u529b\u5c5e\u6027\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093: ''{0}''
TRIGGER_PARAM_MISSING=CDIST2155E 'triggerCount' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002 \u6574\u5408\u9818\u57df\u306e\u30c8\u30ea\u30ac\u30fc\u304c  operatorDriven \u306e\u5834\u5408\u3001'triggerCount' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u6307\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
ERROR_ACQUIRING_PERMIT=CDIST2156E \u8a31\u53ef\u306e\u53d6\u5f97\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f: {0}
OUTPUT_MESSAGE_ATTRIBUTE_MISSING=CDIST2157E 'outputMessageAttributeName' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306b\u65e2\u5b58\u306e\u51fa\u529b\u5c5e\u6027\u3092\u6307\u5b9a\u3059\u308b\u304b\u3001\u51fa\u529b\u30b9\u30ad\u30fc\u30de\u306b "message" \u3068\u3044\u3046\u540d\u524d\u306e\u51fa\u529b\u5c5e\u6027\u3092\u542b\u3081\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
# TRNOTE: do not translate "Event Streams"
INVALID_MESSAGEHUB_JSON_CREDS=CDIST2158E Event Streams \u30b5\u30fc\u30d3\u30b9\u8cc7\u683c\u60c5\u5831 JSON \u304c\u7121\u52b9\u3067\u3059: {0}
APPLICATION_CONFIGURATION_NOT_FOUND=CDIST2159W \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u69cb\u6210\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093: {0}
MESSAGE_ATTRIBUTE_NOT_FOUND=CDIST2160E \u30e1\u30c3\u30bb\u30fc\u30b8\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002 'messageAttribute' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u6307\u5b9a\u3059\u308b\u304b\u3001\u5165\u529b\u30b9\u30ad\u30fc\u30de\u306b "message" \u3044\u3046\u540d\u524d\u306e\u5c5e\u6027\u3092\u542b\u3081\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
OPERATOR_NOT_START_OF_CONSISTENT_REGION=CDIST2161E {0} \u30aa\u30da\u30ec\u30fc\u30bf\u30fc\u306f\u6574\u5408\u9818\u57df\u306e\u958b\u59cb\u306b\u4f7f\u7528\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
PARTITION_ATTRIBUTE_NOT_INT32=CDIST2162E 'partitionAttribute' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u3001'partition' \u5165\u529b\u5c5e\u6027\u306f "int32" \u578b\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
UNSUPPORTED_TYPE_EXCEPTION=CDIST2163E \u5c5e\u6027 ''{1}'' \u306e\u8a2d\u5b9a\u4e2d\u306b\u3001\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044\u30bf\u30a4\u30d7 ''{0}'' \u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f
START_TIME_PARAM_NOT_FOUND=CDIST2164E 'startPosition' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u5024\u304c "Time" \u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001'startTime' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u6307\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
PARAMS_INCOMPATIBLE_WITH_INPUT_PORT=CDIST2165E \u5165\u529b\u30dd\u30fc\u30c8\u304c\u5b58\u5728\u3059\u308b\u5834\u5408\u3001'topic'\u3001'pattern'\u3001'partition'\u3001\u304a\u3088\u3073'startPositition' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u4f7f\u7528\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
TOPIC_OR_INPUT_PORT=CDIST2166E \u5165\u529b\u30dd\u30fc\u30c8\u304c\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u3001'topic' \u307e\u305f\u306f 'pattern' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u6307\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
INVALID_JSON_MISSING_KEY=CDIST2167E \u7121\u52b9\u306a JSON\u3002 ''{0}'' \u30ad\u30fc\u304c\u3042\u308a\u307e\u305b\u3093\u3002 \u30a2\u30af\u30b7\u30e7\u30f3\u306f\u7121\u8996\u3055\u308c\u307e\u3059\u3002 jsonString={1}
PROPERTIES_FILE_NOT_FOUND=CDIST2168W \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u30fb\u30d5\u30a1\u30a4\u30eb\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093: {0}
START_OFFSET_PARAM_NOT_FOUND=CDIST2169E 'startPosition' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u5024\u304c "Offset" \u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001'startOffset' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u6307\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
PARTITION_SIZE_NOT_EQUAL_TO_OFFSET_SIZE=CDIST2170E 'partition' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306b\u6307\u5b9a\u3055\u308c\u305f\u5024\u306e\u6570\u306f\u3001'startOffset' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306b\u6307\u5b9a\u3055\u308c\u305f\u5024\u306e\u6570\u3068\u540c\u3058\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
ONLY_ONE_TOPIC_WHEN_USING_STARTOFFSET_PARAM=CDIST2171E 'startPosition' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u304c 'Offset' \u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001'topic' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u4f7f\u7528\u3057\u3066 1 \u3064\u306e\u30c8\u30d4\u30c3\u30af\u306e\u307f\u3092\u6307\u5b9a\u3067\u304d\u307e\u3059\u3002
PROPERTIES_FILE_NOT_READABLE=CDIST2172E \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u30fb\u30d5\u30a1\u30a4\u30eb {0} \u3092\u8aad\u307f\u53d6\u308c\u307e\u305b\u3093: {1}
OFFSET_COMMIT_FAILED_FOR_PARTITION=CDIST2173W \u30c8\u30d4\u30c3\u30af\u306e\u30d1\u30fc\u30c6\u30a3\u30b7\u30e7\u30f3 {0} \u306b\u5bfe\u3057\u3066\u30aa\u30d5\u30bb\u30c3\u30c8\u3092\u30b3\u30df\u30c3\u30c8\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f: {1}
OFFSET_COMMIT_FAILED=CDIST2174W \u30aa\u30d5\u30bb\u30c3\u30c8\u3092\u30b3\u30df\u30c3\u30c8\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f: {0}
PARAM_IGNORED_IN_CONSITENT_REGION=CDIST2175W \u30aa\u30da\u30ec\u30fc\u30bf\u30fc\u304c\u6574\u5408\u9818\u57df\u306b\u542b\u307e\u308c\u3066\u3044\u308b\u5834\u5408\u3001\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc ''{0}'' \u306f\u7121\u8996\u3055\u308c\u307e\u3059\u3002
PARAM_IGNORED_NOT_IN_CONSITENT_REGION=CDIST2176W \u30aa\u30da\u30ec\u30fc\u30bf\u30fc\u304c\u6574\u5408\u9818\u57df\u306b\u542b\u307e\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u3001\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc ''{0}'' \u306f\u7121\u8996\u3055\u308c\u307e\u3059\u3002
PARAM_INCOMPATIBLE_WITH_OTHER_PARAM_VAL=CDIST2177E ''{1}'' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306b \u5024 ''{2}'' \u304c\u542b\u307e\u308c\u3066\u3044\u308b\u5834\u5408\u3001''{0}'' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306f\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093\u3002
PARAM_VAL_INCOMPATIBLE_WITH_OTHER_PARAM_VAL=CDIST2178E ''{2}'' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306b\u5024 ''{3}'' \u304c\u542b\u307e\u308c\u3066\u3044\u308b\u5834\u5408\u3001''{0}'' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306b\u5024 ''{1}'' \u3092\u4f7f\u7528\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
PARAM_VAL_INCOMPATIBLE_WITH_INPUT_PORT=CDIST2179E ''{1}'' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306b\u5024 ''{2}'' \u304c\u542b\u307e\u308c\u3066\u3044\u308b\u5834\u5408\u3001\u30aa\u30da\u30ec\u30fc\u30bf\u30fc\u306b\u5165\u529b\u30dd\u30fc\u30c8\u3092\u4f7f\u7528\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
PARAM_IGNORED_FOR_PERIODIC_CR=CDIST2180W \u5b9a\u671f\u7684\u6574\u5408\u9818\u57df\u3067\u306f\u3001''{0}'' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306f\u7121\u8996\u3055\u308c\u307e\u3059\u3002
CONSUMER_GROUP_IN_MULTIPLE_CONSISTENT_REGIONS=CDIST2181E \u30b3\u30f3\u30b7\u30e5\u30fc\u30de\u30fc\u30fb\u30b0\u30eb\u30fc\u30d7 ''{1}'' \u306e {0} \u30aa\u30da\u30ec\u30fc\u30bf\u30fc\u306b\u5bfe\u3057\u3066\u3001\u8907\u6570\u306e\u6574\u5408\u9818\u57df\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002\u30b3\u30f3\u30b7\u30e5\u30fc\u30de\u30fc\u30fb\u30b0\u30eb\u30fc\u30d7\u306e\u3059\u3079\u3066\u306e\u30b3\u30f3\u30b7\u30e5\u30fc\u30de\u30fc\u30fb\u30aa\u30da\u30ec\u30fc\u30bf\u30fc\u306f\u3001\u540c\u3058\u6574\u5408\u9818\u57df\u5185\u306b\u53c2\u52a0\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
PARAM_X_REQUIRED_WHEN_PARAM_Y_USED=CDIST2182E ''{1}'' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u4f7f\u7528\u3059\u308b\u5834\u5408\u3001''{0}'' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u6307\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
INVALID_PARAMETER_VALUE=CDIST2183E ''{0}'' \u5024\u306f ''{1}'' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306b\u5bfe\u3057\u3066\u7121\u52b9\u3067\u3059\u3002\u6709\u52b9\u306a\u5024\u306f {2} \u3067\u3059\u3002
WARN_CONTROLPORT_DEPRECATED_IN_CR=CDIST2184W  ''{0}'' \u30aa\u30da\u30ec\u30fc\u30bf\u30fc\u3067\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u306e\u5236\u5fa1\u5165\u529b\u30dd\u30fc\u30c8\u306e\u4f7f\u7528\u306f\u3001\u305d\u306e\u30aa\u30da\u30ec\u30fc\u30bf\u30fc\u304c\u6574\u5408\u9818\u57df\u306b\u542b\u307e\u308c\u3066\u3044\u308b\u5834\u5408\u3001\u63a8\u5968\u3055\u308c\u307e\u305b\u3093\u3002
# TRNOTE: do not translate "startPosition: {0};"
JCP_REQUIRED_NOCR_STARTPOS_NOT_DEFAULT=CDIST2185E ''startPosition: {0};'' \u3092\u30b5\u30dd\u30fc\u30c8\u3059\u308b\u306b\u306f\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b0\u30e9\u30d5\u306b ''JobControlPlane'' \u30aa\u30da\u30ec\u30fc\u30bf\u30fc\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b0\u30e9\u30d5\u306b ''JobControlPlane'' \u30aa\u30da\u30ec\u30fc\u30bf\u30fc\u3092\u8ffd\u52a0\u3057\u3066\u304f\u3060\u3055\u3044\u3002
WARN_ENSURE_JCP_ADDED_STARTPOS_NOT_DEFAULT=CDIST2186W ''{0}'' \u30aa\u30da\u30ec\u30fc\u30bf\u30fc\u3067 ''startPosition'' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306e\u300c\u30c7\u30d5\u30a9\u30eb\u30c8\u300d\u4ee5\u5916\u306e\u5024\u3092\u5b8c\u5168\u306b\u30b5\u30dd\u30fc\u30c8\u3059\u308b\u306b\u306f\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b0\u30e9\u30d5\u306b ''JobControlPlane'' \u30aa\u30da\u30ec\u30fc\u30bf\u30fc\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b0\u30e9\u30d5\u306b ''JobControlPlane'' \u30aa\u30da\u30ec\u30fc\u30bf\u30fc\u3092\u5fc5\u305a\u8ffd\u52a0\u3057\u3066\u304f\u3060\u3055\u3044\u3002
PARAMETERS_EXCLUDE_EACH_OTHER=CDIST2187E ''{0}'' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3068 ''{1}'' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306f\u4e92\u3044\u3092\u9664\u5916\u3057\u307e\u3059\u3002\u3044\u305a\u308c\u304b\u4e00\u65b9\u306e\u307f\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
PATTERN_SUBSCRIPTION_REQUIRES_GROUP_MGT=CDIST2188E ''{0}'' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306f\u3001Kafka \u30b0\u30eb\u30fc\u30d7\u7ba1\u7406\u3092\u6709\u52b9\u306b\u3067\u304d\u308b\u5834\u5408\u306b\u306e\u307f\u4f7f\u7528\u3067\u304d\u307e\u3059\u3002\u30b0\u30eb\u30fc\u30d7\u7ba1\u7406\u3092\u6709\u52b9\u306b\u3059\u308b\u65b9\u6cd5\u3067 ''{1}'' \u30aa\u30da\u30ec\u30fc\u30bf\u30fc\u304c\u69cb\u6210\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u524d\u63d0\u6761\u4ef6\u306b\u3064\u3044\u3066\u306f\u3001''{2}'' \u30aa\u30da\u30ec\u30fc\u30bf\u30fc\u306e SPL \u8cc7\u6599\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
TOPIC_ATTRIBUTE_NOT_STRING=CDIST2189E 'topicAttribute' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u3001'topic' \u5165\u529b\u5c5e\u6027\u306e\u30bf\u30a4\u30d7\u306f "rstring" \u307e\u305f\u306f "ustring" \u3067\u3042\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
PRODUCER_INVALID_OPORT_SCHEMA=CDIST2190E ''{0}'' \u30aa\u30da\u30ec\u30fc\u30bf\u30fc\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u51fa\u529b\u30dd\u30fc\u30c8\u306e\u30b9\u30ad\u30fc\u30de\u304c\u7121\u52b9\u3067\u3059\u3002\u3053\u306e\u30dd\u30fc\u30c8\u3067\u306f\u30012 \u3064\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u5c5e\u6027\u304c\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u304a\u308a\u30011 \u3064\u306f rstring\u3001ustring\u3001\u307e\u305f\u306f\u305d\u308c\u3089\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u3067\u3042\u308b\u5fc5\u8981\u304c\u3042\u308a\u3001\u3082\u3046 1 \u3064\u306f\u30aa\u30da\u30ec\u30fc\u30bf\u30fc\u306e\u5165\u529b\u30dd\u30fc\u30c8\u3068\u540c\u3058\u30b9\u30ad\u30fc\u30de\u3092\u6301\u3064\u30bf\u30d7\u30eb\u30fb\u30bf\u30a4\u30d7\u3067\u3042\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
INVALID_JSON=CDIST2191E \u7121\u52b9\u306a JSON\u3002 \u30a2\u30af\u30b7\u30e7\u30f3\u306f\u7121\u8996\u3055\u308c\u307e\u3059\u3002 jsonString=''{0}''
