# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE
#
# com.ibm.streamsx.kafka.KafkaMessages.properties      CDIST2150 - CDIST2199
#

TOPIC_NOT_SPECIFIED=CDIST2150E No se ha especificado el tema. O bien el esquema de entrada debe contener un atributo llamado "topic", o bien uno es necesario especificar uno de los par\u00e1metros siguientes: 'topicAttribute' o 'topic'
INPUT_ATTRIBUTE_NOT_FOUND=CDIST2151E No se ha encontrado el atributo de entrada: "{0}".
PREVIOUS_BATCH_FAILED_TO_SEND=CDIST2152E El lote anterior no ha podido enviar: {0}
INVALID_PARAMETER_VALUE_GT=CDIST2153E Valor no v\u00e1lido para el par\u00e1metro ''{0}'': {1}. Los valores v\u00e1lidos tienen que ser mayores que {2}.
OUTPUT_ATTRIBUTE_NOT_FOUND=CDIST2154E No se ha encontrado el atributo de salida: "{0}"
TRIGGER_PARAM_MISSING=CDIST2155E No se ha especificado el par\u00e1metro 'triggerCount'. El par\u00e1metro 'triggerCount' se tiene que especificar cuando el desencadenante de la regi\u00f3n coherente es operatorDriven.
ERROR_ACQUIRING_PERMIT=CDIST2156E Error al adquirir permiso: {0}
OUTPUT_MESSAGE_ATTRIBUTE_MISSING=CDIST2157E O bien el par\u00e1metro 'outputMessageAttributeName' debe especificar un atributo de salida existente, o bien el esquema de salida debe contener un atributo de salida llamado "message".
INVALID_MESSAGEHUB_JSON_CREDS=CDIST2158E JSON de credenciales de MessageHub no v\u00e1lido: {0}
APPLICATION_CONFIGURATION_NOT_FOUND=CDIST2159W No se ha encontrado la configuraci\u00f3n de aplicaci\u00f3n: {0}
MESSAGE_ATTRIBUTE_NOT_FOUND=CDIST2160E No se ha especificado el mensaje. O bien se debe especificar el par\u00e1metro 'messageAttribute', o bien el esquema de entrada debe contener un atributo llamado "message".
OPERATOR_NOT_START_OF_CONSISTENT_REGION=CDIST2161E El operador {0} no puede ser el inicio de una regi\u00f3n coherente.
PARTITION_ATTRIBUTE_NOT_INT32=CDIST2162E El atributo de entrada 'partition' debe tener un tipo "int32" cuando no se especifica el par\u00e1metro 'partitionAttribute'.
UNSUPPORTED_TYPE_EXCEPTION=CDIST2163E Tipo no soportado: "{0}" al establecer el atributo "{1}"
START_TIME_PARAM_NOT_FOUND=CDIST2164E El par\u00e1metro 'startTime' se tiene que especificar cuando el valor del par\u00e1metro 'startPosition' se establece en "Time".
TOPIC_OR_INPUT_PORT=CDIST2166E El par\u00e1metro 'topic' se tiene especificar cuando no hay ning\u00fan puerto de entrada definido.
INVALID_JSON_MISSING_KEY=CDIST2167E \u00a1JSON no v\u00e1lido! Falta la clave \"{0}\". Se ignora la actualizaci\u00f3n. jsonString={1}
PROPERTIES_FILE_NOT_FOUND=CDIST2168W No se puede encontrar el archivo de propiedades: {0}
START_OFFSET_PARAM_NOT_FOUND=CDIST2169E El par\u00e1metro 'startOffset' se tiene que especificar cuando el valor del par\u00e1metro 'startPosition' se establece en "Offset".
PARTITION_SIZE_NOT_EQUAL_TO_OFFSET_SIZE=CDIST2170E El n\u00famero de valores especificado para 'partitionParameter' tiene que ser igual que el n\u00famero de valores especificado para el par\u00e1metro 'startOffset'.
ONLY_ONE_TOPIC_WHEN_USING_STARTOFFSET_PARAM=CDIST2171E Cuando el par\u00e1metro 'startPosition' se establece en 'Offset', solo se puede especificar un \u00fanico tema a trav\u00e9s del par\u00e1metro 'topic'. 
